app/views/posts/index.html.erb

        <td>
        <%= collection_select(:post, :status_id, Status.all, :id, :status) %>
---
SELECT "posts".* FROM "posts"
SELECT "statuses".* FROM "statuses"