app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?)  [["content", "change all pages"], ["created_at", "2020-11-08 16:19:13.596796"], ["updated_at", "2020-11-08 16:19:13.596796"], ["post_id", 9]]
---
def create
    @comment = @post.comments.create(comment_params)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Decide what colors to use today"], ["updated_at", "2020-11-07 13:46:17.416689"], ["id", 5]]
---
def update
    @comment = Comment.find(params[:id])
    @comment.update(comment_params)