app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" ORDER BY "pages"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @pages = Page.all

INSERT INTO "pages" ("title", "body", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My Bio"], ["body", "Hello"], ["slug", "bio"], ["created_at", "2020-10-09 11:15:04.514706"], ["updated_at", "2020-10-09 11:15:04.514706"]]
---
    def create
        page_params = params.require(:page).permit(:title, :body, :slug)
        @page = Page.new(page_params)
        @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "pages" SET "title" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["title", "My Bio12"], ["updated_at", "2020-11-07 17:28:50.179486"], ["id", 3]]
---
    def update
        @page = Page.find(params[:id])
        @page.update(page_params)